ninxmeow/Holy80/lib/chibios-contrib/os/common/ext/CMSIS/AT32/AT32F403_7xx/at32f403_7xx.h
/******************  Bit definition for IOMUX_REMAP3 register  ************/
#define IOMUX_REMAP3_TMR9_GMUX              (0xFU << 0)
#define IOMUX_REMAP3_TMR9_GMUX_NOREMAP      (0x0U << 0)     /*!< TMR9 CH1/PA2 CH2/PA3 */
#define IOMUX_REMAP3_TMR9_GMUX_FULLREMAP    (0x1U << 0)     /*!< TMR9 CH1/PE5 CH2/PE6 */

/******************  Bit definition for IOMUX_REMAP4 register  ************/
#define IOMUX_REMAP4_TMR1_GMUX               (0xFU << 0)
#define IOMUX_REMAP4_TMR1_GMUX_NOREMAP       (0x0U << 0)    /*!< TMR1 EXT/PA12,CH1/PA8,CH2/PA9,CH3/PA10,CH4/PA11,BRK/PB12,CH1C/PB13,CH2C/PB14,CH3C/PB15 */
#define IOMUX_REMAP4_TMR1_GMUX_PARTIALREMAP  (0x1U << 0)    /*!< TMR1 EXT/PA12,CH1/PA8,CH2/PA9,CH3/PA10,CH4/PA11,BRK/PA6,CH1C/PA7,CH2C/PB0,CH3C/PB1 */
#define IOMUX_REMAP4_TMR1_GMUX_FULLREMAP     (0x3U << 0)    /*!< TMR1 EXT/PE7,CH1/PE9,CH2/PE11,CH3/PE13,CH4/PE14,BRK/PE15,CH1C/PE8,CH2C/PE10,CH3C/PE12 */
#define IOMUX_REMAP4_TMR2_GMUX               (0x3U << 4)
#define IOMUX_REMAP4_TMR2_GMUX_NOREMAP       (0x0U << 4)    /*!< TMR2 CH1_EXT/PA0 CH2/PA1 CH3/PA2 CH4/PA3 */
#define IOMUX_REMAP4_TMR2_GMUX_PARTIALREMAP1 (0x1U << 4)    /*!< TMR2 CH1_EXT/PA15 CH2/PB3 CH3/PA2 CH4/PA3 */
#define IOMUX_REMAP4_TMR2_GMUX_PARTIALREMAP2 (0x2U << 4)    /*!< TMR2 CH1_EXT/PA0 CH2/PA1 CH3/PB10 CH4/PB11 */
#define IOMUX_REMAP4_TMR2_GMUX_FULLREMAP     (0x3U << 4)    /*!< TMR2 CH1_EXT/PA15 CH2/PB3 CH3/PB10 CH4/PB11 */
#define IOMUX_REMAP4_TMR2ITR1_GMUX           (0x3U << 6)
#define IOMUX_REMAP4_TMR2ITR1_GMUX_NOREMAP   (0x0U << 6)    /*!< TMR2 TMR8_TRGO->TMR2 ITR1输入 */
#define IOMUX_REMAP4_TMR2ITR1_GMUX_PARTIALREMAP (0x2U << 6) /*!< TMR2 在内部连接以太网的 PTP 输出至 TMR2_ITR1 */
#define IOMUX_REMAP4_TMR2ITR1_GMUX_FULLREMAP (0x3U << 6)    /*!< TMR2 USB SOF  ->TMR2_ITR1输入,TMR2_GMUX/TMR2_MUX 功能失效 */
#define IOMUX_REMAP4_TMR3_GMUX               (0xFU << 8)
#define IOMUX_REMAP4_TMR3_GMUX_NOREMAP       (0x0U << 8)    /*!< TMR3 CH1/PA6 CH2/PA7 CH3/PB0 CH4/PB1 */
#define IOMUX_REMAP4_TMR3_GMUX_PARTIALREMAP  (0x2U << 8)    /*!< TMR3 CH1/PB4 CH2/PB5 CH3/PB0 CH4/PB1 */
#define IOMUX_REMAP4_TMR3_GMUX_FULLREMAP     (0x3U << 8)    /*!< TMR3 CH1/PC6 CH2/PC7 CH3/PC8 CH4/PC9 */
#define IOMUX_REMAP4_TMR4_GMUX               (0xFU << 12)
#define IOMUX_REMAP4_TMR4_GMUX_NOREMAP       (0x0U << 12)   /*!< TMR4 CH1/PB6 CH2/PB7 CH3/PB8 CH4/PB9 */
#define IOMUX_REMAP4_TMR4_GMUX_FULLREMAP     (0x1U << 12)   /*!< TMR4 CH1/PD12 CH2/PD13 CH3/PD14 CH4/PD15 */
#define IOMUX_REMAP4_TMR5CH4_GMUX            (0x1U << 19)
#define IOMUX_REMAP4_TMR5CH4_GMUX_NOREMAP    (0x0U << 19)   /*!< TMR5 CH4/PA3 */
#define IOMUX_REMAP4_TMR5CH4_GMUX_FULLREMAP  (0x1U << 19)   /*!< TMR5 CH4/LICK */

/******************  Bit definition for IOMUX_REMAP5 register  ************/
#define IOMUX_REMAP5_UART5_GMUX              (0xFU << 0)
#define IOMUX_REMAP5_UART5_GMUX_NOREMAP      (0x0U << 0)    /*!< TX/PC12 RX/PD2 */
#define IOMUX_REMAP5_UART5_GMUX_FULLREMAP    (0x1U << 0)    /*!< TX/PB9 RX/PB8 */
#define IOMUX_REMAP5_I2C1_GMUX               (0xFU << 4)
#define IOMUX_REMAP5_I2C1_GMUX_NOREMAP       (0x0U << 4)    /*!< SCL/PB6,SDA/PB7 SMBA/PB5 */
#define IOMUX_REMAP5_I2C1_GMUX_FULLREMAP     (0x1U << 4)    /*!< SCL/PB8,SDA/PB9 SMBA/PB5 */
#define IOMUX_REMAP5_I2C3_GMUX               (0xFU << 12)
#define IOMUX_REMAP5_I2C3_GMUX_NOREMAP       (0x0U << 12)   /*!< SCL/PA8 SDA/PC9 SMBA/PA9 */
#define IOMUX_REMAP5_I2C3_GMUX_FULLREMAP     (0x1U << 12)   /*!< SCL/PA8 SDA/PB4 SMBA/PA9 */
#define IOMUX_REMAP5_SPI1_GMUX               (0xFU << 16)
#define IOMUX_REMAP5_SPI1_GMUX_NOREMAP       (0x0U << 16)   /*!< CS/PA4,SCK/PA5,MISO/PA6,MOSI/PA7,MCK/PB0  */
#define IOMUX_REMAP5_SPI1_GMUX_PARTIALREMAP1 (0x1U << 16)   /*!< CS/PA15,SCK/PB3,MISO/PB4,MOSI/PB5,MCK/PB0 */
#define IOMUX_REMAP5_SPI1_GMUX_PARTIALREMAP2 (0x2U << 16)   /*!< CS/PA4,SCK/PA5,MISO/PA6,MOSI/PA7,MCK/PB6  */
#define IOMUX_REMAP5_SPI1_GMUX_FULLREMAP     (0x3U << 16)   /*!< CS/PA15,SCK/PB3,MISO/PB4,MOSI/PB5,MCK/PB6 */
#define IOMUX_REMAP5_SPI2_GMUX               (0xFU << 20)
#define IOMUX_REMAP5_SPI2_GMUX_NOREMAP       (0x0U << 20)   /*!< MCK/PC6 */
#define IOMUX_REMAP5_SPI2_GMUX_PARTIALREMAP  (0x1U << 20)   /*!< MCK/PA3 */
#define IOMUX_REMAP5_SPI2_GMUX_FULLREMAP     (0x2U << 20)   /*!< MCK/PA6 */
#define IOMUX_REMAP5_SPI3_GMUX               (0xFU << 24)
#define IOMUX_REMAP5_SPI3_GMUX_NOREMAP       (0x0U << 24)   /*!< CS/PA15,SCK/PB3,MISO/PB4,MOSI/PB5,MCK/PC7  */
#define IOMUX_REMAP5_SPI3_GMUX_PARTIALREMAP1 (0x1U << 24)   /*!< CS/PA4,SCK/PC10,MISO/PC11,MOSI/PC12,MCK/PC7 */
#define IOMUX_REMAP5_SPI3_GMUX_PARTIALREMAP2 (0x2U << 24)   /*!< CS/PA15,SCK/PB3,MISO/PB4,MOSI/PB5,MCK/PB10  */
#define IOMUX_REMAP5_SPI3_GMUX_FULLREMAP     (0x3U << 24)   /*!< CS/PA4,SCK/PC10,MISO/PC11,MOSI/PC12,MCK/PB10 */
#define IOMUX_REMAP5_SPI4_GMUX               (0xFU << 28)
#define IOMUX_REMAP5_SPI4_GMUX_NOREMAP       (0x0U << 28)   /*!< CS/PE4 SCK/PE2 MISO/PE5 MOSI/PE6,MCK/PC8  */
#define IOMUX_REMAP5_SPI4_GMUX_PARTIALREMAP1 (0x1U << 28)   /*!< CS/PE12 SCK/PE11 MISO/PE13 MOSI/PE14 MCK/PC8 */
#define IOMUX_REMAP5_SPI4_GMUX_PARTIALREMAP2 (0x2U << 28)   /*!< CS/PB6 SCK/PB7 MISO/PB8 MOSI/PB9 MCK/PC8  */
#define IOMUX_REMAP5_SPI4_GMUX_FULLREMAP     (0x3U << 28)   /*!< CS/PB6 SCK/PB7 MISO/PB8 MOSI/PB9 MCK/PA10 */

/******************  Bit definition for IOMUX_REMAP6 register  ************/
#define IOMUX_REMAP6_CAN1_GMUX                (0xFU << 0)
#define IOMUX_REMAP6_CAN1_GMUX_NOREMAP        (0x0U << 0)    /*!< RX/PA11,TX/PA12 */
#define IOMUX_REMAP6_CAN1_GMUX_PARTIALREMAP   (0x2U << 0)    /*!< RX/PB8,TX/PB9   */
#define IOMUX_REMAP6_CAN1_GMUX_FULLREMAP      (0x3U << 0)    /*!< RX/PD0,TX/PD1   */
#define IOMUX_REMAP6_CAN2_GMUX                (0xFU << 4)
#define IOMUX_REMAP6_CAN2_GMUX_NOREMAP        (0x0U << 4)    /*!< RX/PB12,TX/PB13 */
#define IOMUX_REMAP6_CAN2_GMUX_FULLREMAP      (0x1U << 4)    /*!< RX/PB5,TX/PB6   */
#define IOMUX_REMAP6_SDIO2_GMUX               (0xFU << 12)
#define IOMUX_REMAP6_SDIO2_GMUX_NOREMAP       (0x0U << 12)   /*!< D0/PC0 D1/PC1 D2/PC3 D4/PA4 D5/PA5 D6/PA6 D7/PA7 CK/PC4 CMD/PC5 */
#define IOMUX_REMAP6_SDIO2_GMUX_FULLREMAP     (0x1U << 12)   /*!< D0/PA4 D1/PA5 D2/PA6 D3/PA7 CK/PA2 CMD/PA3 */
#define IOMUX_REMAP6_USART1_GMUX              (0xFU << 16)
#define IOMUX_REMAP6_USART1_GMUX_NOREMAP      (0x0U << 16)   /*!< TX/PA9 RX/PA10  */
#define IOMUX_REMAP6_USART1_GMUX_FULLREMAP    (0x1U << 16)   /*!< TX/PB6 RX/PB7   */
#define IOMUX_REMAP6_USART2_GMUX              (0xFU << 20)
#define IOMUX_REMAP6_USART2_GMUX_NOREMAP      (0x0U << 20)   /*!< CTS/PA0,RTS/PA1,TX/PA2,RX/PA3,CK/PA4  */
#define IOMUX_REMAP6_USART2_GMUX_FULLREMAP    (0x1U << 20)   /*!< CTS/PD3,RTS/PD4,TX/PD5,RX/PD6,CK/PD7   */
#define IOMUX_REMAP6_USART3_GMUX              (0xFU << 24)
#define IOMUX_REMAP6_USART3_GMUX_NOREMAP      (0x0U << 24)   /*!< TX/PB10,RX/PB11,CK/PB12,CTS/PB13,RTS/PB14  */
#define IOMUX_REMAP6_USART3_GMUX_PARTIALREMAP (0x1U << 24)   /*!< TX/PC10,RX/PC11,CK/PC12,CTS/PB13,RTS/PB14  */
#define IOMUX_REMAP6_USART3_GMUX_FULLREMAP    (0x3U << 24)   /*!< TX/PD8,RX/PD9,CK/PD10,CTS/PD11,RTS/PD12  */
#define IOMUX_REMAP6_UART4_GMUX               (0xFU << 28)
#define IOMUX_REMAP6_UART4_GMUX_NOREMAP       (0x0U << 28)   /*!< TX/PC10 RX/PC11  */
#define IOMUX_REMAP6_UART4_GMUX_FULLREMAP     (0x2U << 28)   /*!< TX/PA0 RX/PA1    */

/******************  Bit definition for IOMUX_REMAP7 register  ************/
#define IOMUX_REMAP7_EXT_SPIM_GMUX            (0x7U << 0)
#define IOMUX_REMAP7_EXT_SPIM_GMUX_NOREMAP    (0x0U << 0)    /*!< SCK/PB1 CS/PA8 IO0/PA11 IO1/PA12 IO2/PB7 IO3/PB6 */
#define IOMUX_REMAP7_EXT_SPIM_GMUX_FULLREMAP  (0x1U << 0)    /*!< SCK/PB1 CS/PA8 IO0/PB10 IO1/PB11 IO2/PB7 IO3/PB6 */
#define IOMUX_REMAP7_EXT_SPIM_GEN             (0x1U << 3)
#define IOMUX_REMAP7_ADC1_ETP_GMUX            (0x1U << 4)
#define IOMUX_REMAP7_ADC1_ETP_GMUX_NOREMAP    (0x0U << 4)    /*!< ADC1 抢占转换外部触发连接到 EXINT15 */
#define IOMUX_REMAP7_ADC1_ETP_GMUX_FULLREMAP  (0x1U << 4)    /*!< ADC1 抢占转换外部触发连接到 TMR8 通道 4 */
#define IOMUX_REMAP7_ADC1_ETO_GMUX            (0x1U << 5)
#define IOMUX_REMAP7_ADC1_ETO_GMUX_NOREMAP    (0x0U << 5)    /*!< ADC1 普通转换外部触发连接到 EXINT11 */
#define IOMUX_REMAP7_ADC1_ETO_GMUX_FULLREMAP  (0x1U << 5)    /*!< ADC1 普通转换外部触发连接到 TMR8_TRGO */
#define IOMUX_REMAP7_ADC2_ETP_GMUX            (0x1U << 8)
#define IOMUX_REMAP7_ADC2_ETP_GMUX_NOREMAP    (0x0U << 8)    /*!< ADC2 抢占转换外部触发连接到 EXINT15 */
#define IOMUX_REMAP7_ADC2_ETP_GMUX_FULLREMAP  (0x1U << 8)    /*!< ADC2 抢占转换外部触发连接到 TMR8 通道 4 */
#define IOMUX_REMAP7_ADC2_ETO_GMUX            (0x1U << 9)
#define IOMUX_REMAP7_ADC2_ETO_GMUX_NOREMAP    (0x0U << 9)    /*!< ADC2 普通转换外部触发连接到 EXINT11 */
#define IOMUX_REMAP7_ADC2_ETO_GMUX_FULLREMAP  (0x1U << 9)    /*!< ADC2 普通转换外部触发连接到 TMR8_TRGO */
#define IOMUX_REMAP7_SWJTAG_GMUX              (0x7U << 16)  
#define IOMUX_REMAP7_SWJTAG_GMUX_RESET        (0x0U << 16)   /*!< Full SWJ (JTAG-DP + SW-DP) : Reset State */
#define IOMUX_REMAP7_SWJTAG_GMUX_NOJNTRST     (0x1U << 16)   /*!< Full SWJ (JTAG-DP + SW-DP) but without JNTRST */
#define IOMUX_REMAP7_SWJTAG_GMUX_JTAGDISABLE  (0x2U << 16)   /*!< JTAG-DP Disabled and SW-DP Enabled */
#define IOMUX_REMAP7_SWJTAG_GMUX_DISABLE      (0x4U << 16)   /*!< JTAG-DP Disabled and SW-DP Disabled */
#define IOMUX_REMAP7_PD01_GMUX                (0x1U << 20)   /*!< Port D0/Port D1 mapping on OSC_IN/OSC_OUT */
#define IOMUX_REMAP7_PD01_GMUX_NOREMAP        (0x0U << 20)   /*!< NO REMAP */
#define IOMUX_REMAP7_PD01_GMUX_FULLREMAP      (0x1U << 20)   /*!< Port D0/Port D1 mapping on OSC_IN/OSC_OUT */
#define IOMUX_REMAP7_XMC_GMUX                 (0x7U << 24)   
#define IOMUX_REMAP7_XMC_GMUX_NOREMAP         (0x0U << 24)   /*!< NEW/PD5 D0/PD14 D1/PD15 D2/PD0 D3/PD1 D4/PE7 D5/PE8 D6/PE9 D7/PE10 D13/PD8 NOE/PD4 */
#define IOMUX_REMAP7_XMC_GMUX_PARTIALREMAP    (0x1U << 24)   /*!< NEW/PD2 D0/PB14 D1/PC6 D2/PC11 D3/PC12 D4/PA2 D5/PA3 D6/PA4 D7/PA5 D13/PB12 NOE/PC5 */
#define IOMUX_REMAP7_XMC_GMUX_FULLREMAP       (0x2U << 24)   /*!< NEW/PC2 D0/PB14 D1/PC6 D2/PC11 D3/PC12 D4/PA2 D5/PA3 D6/PA4 D7/PA5 D13/PB12 NOE/PC5 */
#define IOMUX_REMAP7_XMC_XMC_NADV_GMUX        (0x1U << 27)   /*!< XMC_NADV 不使用，对应的 pin 可被其他外设使用 */

